part_i/orgmode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-29 Wed 04:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spacemacs Org-Mode CheatSheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ahrjarrett" />
</head>
<body>
<div id="content">
<h1 class="title">Spacemacs Org-Mode CheatSheet</h1>
<p>
<a href="https://ontologicalblog.files.wordpress.com/2016/11/spacemacs_cheat_sheet_compact_1-1.pdf">Spacemacs Org-Mode Cheatsheet</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Org Mode Command</th>
<th scope="col" class="org-left">Result</th>
<th scope="col" class="org-left">Mode</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>&lt;SPC&gt; m &lt;RET&gt;</code></td>
<td class="org-left">Create another of that heading below.</td>
<td class="org-left">Command</td>
</tr>

<tr>
<td class="org-left"><code>&lt;SPC&gt; m p</code></td>
<td class="org-left">Start Pomodoro (25 min)</td>
<td class="org-left">Command</td>
</tr>

<tr>
<td class="org-left"><code>&lt;</code></td>
<td class="org-left">Move Cursor Left One Word (works like <code>&lt;SHIFT TAB&gt;</code> in tables, too)</td>
<td class="org-left">Command</td>
</tr>

<tr>
<td class="org-left"><code>&gt;</code></td>
<td class="org-left">Move Cursor Right One Word (works like <code>&lt;TAB&gt;</code> in tables)</td>
<td class="org-left">Command</td>
</tr>

<tr>
<td class="org-left"><code>&lt;TAB&gt;</code></td>
<td class="org-left">Rotate Current Subtree Btwn States</td>
<td class="org-left">Command, cursor on tree</td>
</tr>

<tr>
<td class="org-left"><code>&lt;SHIFT TAB&gt;</code></td>
<td class="org-left">Rotate Entire Buffer Btwn States</td>
<td class="org-left">Command, cursor on tree</td>
</tr>

<tr>
<td class="org-left"><code>g j</code></td>
<td class="org-left">Go down (forward) one heading</td>
<td class="org-left">Command, cursor on tree</td>
</tr>

<tr>
<td class="org-left"><code>g k</code></td>
<td class="org-left">Go up (backward) one heading</td>
<td class="org-left">Command, cursor on tree</td>
</tr>

<tr>
<td class="org-left"><code>&lt; s &lt;TAB&gt;</code></td>
<td class="org-left">In insert mode, add source block</td>
<td class="org-left">Insert</td>
</tr>

<tr>
<td class="org-left"><code>C-c '</code></td>
<td class="org-left">Enter source mode of specfied language in new buffer</td>
<td class="org-left">Command</td>
</tr>

<tr>
<td class="org-left"><code>, c</code></td>
<td class="org-left">In command mode, exit source entry mode</td>
<td class="org-left">Command (from within source code buffer)</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-e</code></td>
<td class="org-left">Export menu</td>
<td class="org-left">Command</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-e h o</code></td>
<td class="org-left">Export to html and open file</td>
<td class="org-left">Command (changes current application)</td>
</tr>
</tbody>
</table>


<div id="outline-container-orgdc06077" class="outline-2">
<h2 id="orgdc06077"><span class="section-number-2">1</span> Practice w/ these things:</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf4ee757" class="outline-4">
<h4 id="orgf4ee757"><span class="section-number-4">1.0.1</span> inside stuff</h4>
<div class="outline-text-4" id="text-1-0-1">
</div>
<ol class="org-ol">
<li><a id="orgdd609f2"></a>inside stuff<br /></li>
</ol>
</div>
<div id="outline-container-orgfca2444" class="outline-4">
<h4 id="orgfca2444"><span class="section-number-4">1.0.2</span> inside stuff</h4>
<div class="outline-text-4" id="text-1-0-2">
</div>
<ol class="org-ol">
<li><a id="org6a32dac"></a>inside stuff<br />
<ol class="org-ol">
<li><a id="orgcb6302a"></a>inside stuff<br />
<ol class="org-ol">
<li><a id="org8a8bd8e"></a>inside stuff<br />
<ol class="org-ol">
<li><a id="orgdeb71a7"></a>inside stuff<br />
<ol class="org-ol">
<li><a id="org98585b6"></a>inside stuff<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org248bd4d" class="outline-4">
<h4 id="org248bd4d"><span class="section-number-4">1.0.3</span> inside the inside</h4>
</div>
<div id="outline-container-org33543e3" class="outline-4">
<h4 id="org33543e3"><span class="section-number-4">1.0.4</span> more stuff like 'er</h4>
</div>
<div id="outline-container-org1a810ee" class="outline-3">
<h3 id="org1a810ee"><span class="section-number-3">1.1</span> more inside stuff</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org5038d90" class="outline-4">
<h4 id="org5038d90"><span class="section-number-4">1.1.1</span> inside the inside</h4>
</div>
<div id="outline-container-orgca8384c" class="outline-4">
<h4 id="orgca8384c"><span class="section-number-4">1.1.2</span> more stuff like 'er</h4>
</div>
</div>
<div id="outline-container-org90aebff" class="outline-3">
<h3 id="org90aebff"><span class="section-number-3">1.2</span> more inside stuff</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org9c90881" class="outline-4">
<h4 id="org9c90881"><span class="section-number-4">1.2.1</span> inside the inside</h4>
</div>
<div id="outline-container-orgc3e6255" class="outline-4">
<h4 id="orgc3e6255"><span class="section-number-4">1.2.2</span> more stuff like 'er</h4>
</div>
</div>
<div id="outline-container-orgb33c715" class="outline-3">
<h3 id="orgb33c715"><span class="section-number-3">1.3</span> more inside stuff</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orge4dc2fb" class="outline-4">
<h4 id="orge4dc2fb"><span class="section-number-4">1.3.1</span> inside the inside</h4>
</div>
<div id="outline-container-orgd08c009" class="outline-4">
<h4 id="orgd08c009"><span class="section-number-4">1.3.2</span> more stuff like 'er</h4>
</div>
</div>
</div>
<div id="outline-container-org5b8ad89" class="outline-2">
<h2 id="org5b8ad89"><span class="section-number-2">2</span> Here they are!</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgcb7e495" class="outline-3">
<h3 id="orgcb7e495"><span class="section-number-3">2.1</span> More stuff.</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org7f44c7e" class="outline-4">
<h4 id="org7f44c7e"><span class="section-number-4">2.1.1</span> inside more stuff is more stuff</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="org1878497"></a>inside more stuff is more stuff 2<br />
<ol class="org-ol">
<li><a id="orgb80548d"></a>inside more stuff is more stuff 3<br />
<ol class="org-ol">
<li><a id="org12fe0c0"></a>inside more stuff is more stuff 4<br />
<ol class="org-ol">
<li><a id="org1fab421"></a>inside more stuff is more stuff 4<br />
<ol class="org-ol">
<li><a id="orgb87fefd"></a>inside more stuff is more stuff 4<br />
<ol class="org-ol">
<li><a id="org46adf47"></a>inside more stuff is more stuff 4<br />
<ol class="org-ol">
<li><a id="org74ce789"></a>inside more stuff is more stuff 4<br />
<ol class="org-ol">
<li><a id="org84f1855"></a>inside more stuff is more stuff<br />
<ol class="org-ol">
<li><a id="org0f9a076"></a>inside more stuff is more stuff 2<br />
<ol class="org-ol">
<li><a id="orgdcf4f5c"></a>inside more stuff is more stuff 3<br />
<ol class="org-ol">
<li><a id="org3cd2262"></a>inside more stuff is more stuff 4<br />
<ol class="org-ol">
<li><a id="org4f7b72b"></a>inside more stuff is more stuff 4<br />
<ol class="org-ol">
<li><a id="org1d94cbb"></a>inside more stuff is more stuff 4<br />
<ol class="org-ol">
<li><a id="orgf9c0539"></a>inside more stuff is more stuff 4<br />
<ol class="org-ol">
<li><a id="org3472335"></a>inside more stuff is more stuff 4<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org87be671" class="outline-2">
<h2 id="org87be671"><span class="section-number-2">3</span> Source Code:</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #6C8C6C;">/* </span><span style="color: #8CAC8C;">how does this format in the browser?</span>
<span style="color: #8CAC8C;"> * is this rendered like ``` blocks in github flavored markdown?</span>
<span style="color: #8CAC8C;"> */</span>

<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">single line comment</span>

<span style="color: #FDECBC; font-weight: bold;">const</span> <span style="color: #ECBC9C;">myConstant</span> = <span style="color: #D9A0A0;">'this is my constant'</span>

<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">not tail-recursive tho</span>
<span style="color: #FDECBC; font-weight: bold;">function</span> <span style="color: #A0EDF0;">factorial</span><span style="color: #DCDCCC;">(</span><span style="color: #ECBC9C;">n</span><span style="color: #DCDCCC;">)</span> <span style="color: #DCDCCC;">{</span>
  <span style="color: #FDECBC; font-weight: bold;">if</span><span style="color: #CCF8CC;">(</span>n === <span style="color: #CCF8CC;">1</span><span style="color: #CCF8CC;">)</span> <span style="color: #FDECBC; font-weight: bold;">return</span> n
  <span style="color: #FDECBC; font-weight: bold;">return</span> n * factorial<span style="color: #CCF8CC;">(</span>n-<span style="color: #CCF8CC;">1</span><span style="color: #CCF8CC;">)</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">a</span> = Array.<span style="color: #CCF8CC;">prototype</span>

console.log<span style="color: #DCDCCC;">(</span>a<span style="color: #DCDCCC;">)</span> <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">[constructor: &#402;, concat: &#402;, pop: &#402;, push: &#402;, shift: &#402;,&#160;&#8230;]</span>

factorial<span style="color: #DCDCCC;">(</span><span style="color: #CCF8CC;">5</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ahrjarrett</p>
<p class="date">Created: 2017-11-29 Wed 04:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
